src/toir_cfe/src/Catalogs/проф_НастройкиСистемы/проф_НастройкиСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6e97bacd-581f-457e-8194-0e56df384c90">
  <name>проф_НастройкиСистемы</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="eabacba6-c7c4-412a-966b-4fb545be0373">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c4e4dd9-9400-4bf0-9b2e-c1573d654f58">
    <name>СодержитСписок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f7730688-f0b4-4a4e-bd02-3164755a6070">
    <name>Список</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ab1fcde9-7b4c-4938-b9c2-6ef7d23645d2">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cfe/src/Catalogs/проф_НастройкиСистемы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СодержитСписокПриИзменении(Элемент)
	
	Если Объект.СодержитСписок Тогда
		Объект.Значение = Неопределено;		
	Иначе	
		Объект.Список.Очистить();
	КонецЕсли;	
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Если Объект.СодержитСписок Тогда
		Элементы.Значение.Видимость = Ложь;
		Элементы.Список.Видимость = Истина;
	Иначе
		Элементы.Значение.Видимость = Истина;
		Элементы.Список.Видимость = Ложь;
	КонецЕсли;		
	
КонецПроцедуры	

#КонецОбласти
